## staging: lambda-api
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 2 to add, 1 to change, 1 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                       NAME                        |
|----------|---------------------------------------------------|
| add      | `aws_wafv2_ip_set.github_actions`                 |
| update   | `aws_wafv2_web_acl.api_lambda`                    |
| recreate | `null_resource.api_gateway_cloudwatch_logging[0]` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
19:50:36.790 STDOUT terraform:   + create
19:50:36.790 STDOUT terraform:   ~ update in-place
19:50:36.790 STDOUT terraform: -/+ destroy and then create replacement
19:50:36.790 STDOUT terraform:  <= read (data resources)
19:50:36.790 STDOUT terraform: Terraform will perform the following actions:
19:50:36.790 STDOUT terraform:   # data.external.github_actions_ips will be read during apply
19:50:36.790 STDOUT terraform:   # (config refers to values not yet known)
19:50:36.790 STDOUT terraform:  <= data "external" "github_actions_ips" {
19:50:36.790 STDOUT terraform:       + id      = (known after apply)
19:50:36.790 STDOUT terraform:       + program = [
19:50:36.790 STDOUT terraform:           + "helper_scripts/update_github_actions_ips.sh",
19:50:36.790 STDOUT terraform:         ]
19:50:36.790 STDOUT terraform:       + query   = {
19:50:36.790 STDOUT terraform:           + "timestamp" = (known after apply)
19:50:36.790 STDOUT terraform:         }
19:50:36.790 STDOUT terraform:       + result  = (known after apply)
19:50:36.790 STDOUT terraform:     }
19:50:36.790 STDOUT terraform:   # aws_wafv2_ip_set.github_actions will be created
19:50:36.790 STDOUT terraform:   + resource "aws_wafv2_ip_set" "github_actions" {
19:50:36.790 STDOUT terraform:       + addresses          = (known after apply)
19:50:36.790 STDOUT terraform:       + arn                = (known after apply)
19:50:36.790 STDOUT terraform:       + description        = "IP ranges for GitHub Actions runners auto-updated"
19:50:36.791 STDOUT terraform:       + id                 = (known after apply)
19:50:36.791 STDOUT terraform:       + ip_address_version = "IPV4"
19:50:36.791 STDOUT terraform:       + lock_token         = (known after apply)
19:50:36.791 STDOUT terraform:       + name               = "github-actions-ip-set"
19:50:36.791 STDOUT terraform:       + name_prefix        = (known after apply)
19:50:36.791 STDOUT terraform:       + region             = "ca-central-1"
19:50:36.791 STDOUT terraform:       + scope              = "REGIONAL"
19:50:36.791 STDOUT terraform:       + tags               = (known after apply)
19:50:36.791 STDOUT terraform:       + tags_all           = (known after apply)
19:50:36.791 STDOUT terraform:     }
19:50:36.791 STDOUT terraform:   # aws_wafv2_web_acl.api_lambda will be updated in-place
19:50:36.791 STDOUT terraform:   ~ resource "aws_wafv2_web_acl" "api_lambda" {
19:50:36.791 STDOUT terraform:         id                          = "24e77018-6b08-41e8-8d1b-de9f5e46fd69"
19:50:36.791 STDOUT terraform:         name                        = "api-lambda-waf"
19:50:36.791 STDOUT terraform:         tags                        = {
19:50:36.791 STDOUT terraform:             "CostCenter" = "notification-canada-ca-staging"
19:50:36.791 STDOUT terraform:         }
19:50:36.791 STDOUT terraform:         # (11 unchanged attributes hidden)
19:50:36.791 STDOUT terraform:       - rule {
19:50:36.791 STDOUT terraform:           # At least one attribute in this block is (or was) sensitive,
19:50:36.791 STDOUT terraform:           # so its contents will not be displayed.
19:50:36.791 STDOUT terraform:         }
19:50:36.791 STDOUT terraform:       - rule {
19:50:36.791 STDOUT terraform:           # At least one attribute in this block is (or was) sensitive,
19:50:36.791 STDOUT terraform:           # so its contents will not be displayed.
19:50:36.791 STDOUT terraform:         }
19:50:36.791 STDOUT terraform:       - rule {
19:50:36.791 STDOUT terraform:           # At least one attribute in this block is (or was) sensitive,
19:50:36.791 STDOUT terraform:           # so its contents will not be displayed.
19:50:36.791 STDOUT terraform:         }
19:50:36.791 STDOUT terraform:       - rule {
19:50:36.791 STDOUT terraform:           # At least one attribute in this block is (or was) sensitive,
19:50:36.791 STDOUT terraform:           # so its contents will not be displayed.
19:50:36.791 STDOUT terraform:         }
19:50:36.791 STDOUT terraform:       - rule {
19:50:36.792 STDOUT terraform:           # At least one attribute in this block is (or was) sensitive,
19:50:36.792 STDOUT terraform:           # so its contents will not be displayed.
19:50:36.792 STDOUT terraform:         }
19:50:36.792 STDOUT terraform:       - rule {
19:50:36.792 STDOUT terraform:           # At least one attribute in this block is (or was) sensitive,
19:50:36.792 STDOUT terraform:           # so its contents will not be displayed.
19:50:36.792 STDOUT terraform:         }
19:50:36.792 STDOUT terraform:       - rule {
19:50:36.792 STDOUT terraform:           # At least one attribute in this block is (or was) sensitive,
19:50:36.792 STDOUT terraform:           # so its contents will not be displayed.
19:50:36.792 STDOUT terraform:         }
19:50:36.792 STDOUT terraform:       + rule {
19:50:36.792 STDOUT terraform:           # At least one attribute in this block is (or was) sensitive,
19:50:36.792 STDOUT terraform:           # so its contents will not be displayed.
19:50:36.792 STDOUT terraform:         }
19:50:36.792 STDOUT terraform:       + rule {
19:50:36.792 STDOUT terraform:           # At least one attribute in this block is (or was) sensitive,
19:50:36.792 STDOUT terraform:           # so its contents will not be displayed.
19:50:36.792 STDOUT terraform:         }
19:50:36.792 STDOUT terraform:       + rule {
19:50:36.792 STDOUT terraform:           # At least one attribute in this block is (or was) sensitive,
19:50:36.792 STDOUT terraform:           # so its contents will not be displayed.
19:50:36.792 STDOUT terraform:         }
19:50:36.792 STDOUT terraform:       + rule {
19:50:36.792 STDOUT terraform:           # At least one attribute in this block is (or was) sensitive,
19:50:36.792 STDOUT terraform:           # so its contents will not be displayed.
19:50:36.792 STDOUT terraform:         }
19:50:36.792 STDOUT terraform:       + rule {
19:50:36.792 STDOUT terraform:           # At least one attribute in this block is (or was) sensitive,
19:50:36.792 STDOUT terraform:           # so its contents will not be displayed.
19:50:36.792 STDOUT terraform:         }
19:50:36.792 STDOUT terraform:       + rule {
19:50:36.792 STDOUT terraform:           # At least one attribute in this block is (or was) sensitive,
19:50:36.792 STDOUT terraform:           # so its contents will not be displayed.
19:50:36.792 STDOUT terraform:         }
19:50:36.792 STDOUT terraform:       + rule {
19:50:36.793 STDOUT terraform:           # At least one attribute in this block is (or was) sensitive,
19:50:36.793 STDOUT terraform:           # so its contents will not be displayed.
19:50:36.793 STDOUT terraform:         }
19:50:36.793 STDOUT terraform:         # (5 unchanged blocks hidden)
19:50:36.793 STDOUT terraform:     }
19:50:36.793 STDOUT terraform:   # null_resource.api_gateway_cloudwatch_logging[0] must be replaced
19:50:36.793 STDOUT terraform: -/+ resource "null_resource" "api_gateway_cloudwatch_logging" {
19:50:36.796 STDOUT terraform:       ~ id       = "5442368518975551566" -> (known after apply)
19:50:36.796 STDOUT terraform:       ~ triggers = { # forces replacement
19:50:36.796 STDOUT terraform:           ~ "always_run" = "2025-09-15T15:11:20Z" -> (known after apply)
19:50:36.796 STDOUT terraform:         }
19:50:36.796 STDOUT terraform:     }
19:50:36.796 STDOUT terraform: Plan: 2 to add, 1 to change, 1 to destroy.
19:50:36.796 STDOUT terraform: Changes to Outputs:
19:50:36.796 STDOUT terraform:   + github_actions_ip_count       = (known after apply)
19:50:36.796 STDOUT terraform:   + github_actions_ip_set_arn     = (known after apply)
19:50:36.796 STDOUT terraform:   + github_actions_using_fallback = (known after apply)
19:50:36.796 STDOUT terraform: ─────────────────────────────────────────────────────────────────────────────
19:50:36.796 STDOUT terraform: Saved the plan to: plan.tfplan
19:50:36.796 STDOUT terraform: To perform exactly these actions, run the following command to apply:
19:50:36.796 STDOUT terraform:     terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_api_gateway_domain_name.alt_api_lambda"]
WARN - plan.json - main - Missing Common Tags: ["aws_api_gateway_domain_name.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_api_gateway_domain_name.api_lambda"]
WARN - plan.json - main - Missing Common Tags: ["aws_api_gateway_rest_api.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_api_gateway_stage.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_appautoscaling_target.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.api_gateway_log_group"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.api_lambda_log_group[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.api-gateway-5xx-error-critical[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.api-gateway-5xx-error-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.api-gateway-timeout-5-minute-critical[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.api-gateway-timeout-5-minute-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.failed-login-count-5-minute-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.lambda-api-throttle-critical[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.lambda-api-throttle-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.logs-1-error-1-minute-warning-lambda-api[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.logs-1-error-1-minute-warning-salesforce-api[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.logs-10-error-5-minutes-critical-lambda-api[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.api"]
WARN - plan.json - main - Missing Common Tags:...
```

</details>
